"""
 Електронне CV
"""


my_data={"name": "Маргарита Литвиненко",
         "address": "м.Харків",
         "telefone":"+380667247754",
         "email": "virit9192@gmail.com"}

education = [
    "2013–2014 — Харківський національний університет радіоелектроніки",
    "Факультет телекомунікацій та вимірювальної техніки",
    "Спеціальність: інформаційні мережі зв’язку",
    "Кваліфікація: магістр"
]

skills=["ЄДЕБО",
        "МКР",
        "AzaPro",
        "FossDoc",
        "PyCharm",
        "Python",
        "Git",
        "GitHub",
        "адміністрування баз даних",
        "навчання користувачів",
        "документообіг"]

experience = (
    "2014 – по теперішній час — Харківський національний автомобільно-дорожній університет",
    "Інженер",
    "Робота з базою ЄДЕБО, оновлення та перевірка даних",
    "Замовлення студентських квитків і дипломів",
    "Робота у внутрішніх інформаційних системах",
    "Навчання співробітників у МКР",
    "Документообіг у FossDoc",
    "Нарахування стипендій у AzaPro",
    "Актуалізація освітніх даних",
    "Взаємодія з факультетами та навчальним відділом"
)


print("ПЕРСОНАЛЬНІ ДАНІ:")

for key, value in my_data.items():
    print(f"{key}: {value}")

print("\nОСВІТА:")
for edu in education:
    print(f"  - {edu}")

print("\nНАВИЧКИ:")
print("  - " + ", ".join(skills))

print("\nДОСВІД:")
for item in experience:
    print(f"  - {item}")





