# --------------------------- Homework_4  ------------------------------------

"""
Програмний розрахунок площі трикутника

Ця програма запитує у користувача довжину основи a та висоту h,
перевіряє коректність введених значень і обчислює площу трикутника
за формулою S = (a * h) / 2.
"""

def area_triangle() -> None:
    '''
    Функція:
    - приймає значення основи a та висоти h від користувача,
    - перевіряє їх на коректність (обидва мають бути додатні числа),
    - виконує розрахунок площі за формулою S = (a * h) / 2,
    - виводить результат, округлений до двох знаків після коми.

    :return: None
    '''

    try:
        # Введення значень користувачем
        a = float(input("довжина основи a = ")) # a - основа трикутника
        h = float(input("висота h = ")) # h - висота трикутника

    except ValueError: # Обробка помилки, якщо введено не число
        print("Помилка: введіть числові значення!")

    else: # Перевірка значень
        if a <= 0 or h <= 0: # a та h не можуть бути меньше або дорівнювати 0
            print("довжина основи та висота не можуть бути меньше або дорівнювати 0")
        else:
            S = (a * h) / 2 # розрахунок площі трикутника
            print(f"Площа трикутника S = {round(S, 2)}")

    finally:
        print("Програма завершена ")

if __name__ == "__main__":
    area_triangle()

