"""
Реалізувати програмно логіку роботи алгоритму FizzBuzz.
На вхід алгоритму подається деяке число n.
Необхідно сформувати вихідну послідовність, що відповідає властивостям
числа n:
якщо число можна поділити на 3 без залишку, замість числа буде виведено Fizz.
якщо число ділиться на 5 без залишку, результат відображатиме Buzz.
якщо дане число ділиться і на 3, і на 5, замість числа буде надруковано FizzBuzz.
якщо число не можна поділити на 3 або 5, воно буде надруковано в оригіналі
"""

n=int(input('число: '))
for i in range(1,n+1):

    if i%3==0 and i%5==0:
        print("FizzBuzz")
    elif i%5==0:
        print("Buzz")
    elif i%3==0:
        print("Fizz")
    else:
        print(i)


