
# --------------------------- Homework_4  ------------------------------------

"""
 Електронне CV
"""
def my_cv() -> None:
    '''
    Створює текстовий файл із резюме користувача.

    Функція:
    - формує словник з персональними даними,
    - зберігає інформацію про освіту, навички та досвід роботи,
    - записує всі дані у файл 'resume.txt' у структурованому вигляді,
    - обробляє можливі помилки під час роботи з файлами.

    :return: None
    '''
    # Персональні дані
    my_data={"ім`я": "Маргарита Литвиненко",
            "адреса": "м.Харків",
            "телефон":"+380667247754",
            "email": "virit9192@gmail.com"}

    # Освіта
    education = [
        "2009–2014 — Харківський національний університет радіоелектроніки",
        "Факультет телекомунікацій та вимірювальної техніки",
        "Спеціальність: інформаційні мережі зв’язку",
        "Кваліфікація: магістр"
    ]

    # Навички
    skills=["ЄДЕБО",
            "МКР",
            "AzaPro",
            "FossDoc",
            "адміністрування баз даних",
            "навчання користувачів",
            "документообіг"]

    # Досвід роботи
    experience = (
        "2014 – по теперішній час — Харківський національний автомобільно-дорожній університет",
        "Інженер",
        "Робота з базою ЄДЕБО, оновлення та перевірка даних",
        "Замовлення студентських квитків і дипломів",
        "Робота у внутрішніх інформаційних системах",
        "Навчання співробітників у МКР",
        "Документообіг у FossDoc",
        "Нарахування стипендій у AzaPro",
        "Актуалізація освітніх даних",
        "Взаємодія з факультетами та навчальним відділом"
    )

    try:
        filename = "resume.txt"

        # Створення файлу та запис заголовка
        with open(filename, 'w', encoding='utf-8') as file:
            file.write("ПЕРСОНАЛЬНІ ДАНІ:\n")

        # Запис персональних даних
        with open(filename, 'a', encoding='utf-8') as file:
            for key, value in my_data.items():
                file.write(f"   {key}: {value}\n")

        # Запис розділу освіти
        with open(filename, 'a', encoding='utf-8') as file:
            file.write("\nОСВІТА:\n")
            for edu in education:
                file.write(f"  - {edu}\n")

        # Запис навичок
        with open(filename, 'a', encoding='utf-8') as file:
            file.write("\nНАВИЧКИ:\n")
            file.write("  - " + ", ".join(skills))

        # Запис досвіду роботи
        with open(filename, 'a', encoding='utf-8') as file:
            file.write("\n\nДОСВІД:\n")
            for item in experience:
                file.write(f"  - {item}\n")

    except FileNotFoundError:
        print("Помилка: файл не знайдено.")
    else:
        print("Резюме створено.")
    finally:
        print("Програма завершена.")

if __name__ == "__main__":
    my_cv()

